import random

TEXT_POOL = """
Чак Норрис меняет кожу дважды в год.
Наносимый Чаком Норрисом удар ногой с разворота является предпочтительным способом смертной казни в 16 штатах.
Чак Норрис бородой режет воду.
Ученые установили, что энергия, выделившаяся при Большом Взрыве примерно равна 1 УЧННР (Удару Чака Норриса Ногой с Разворота)
Энергии удара Чака Норриса ногой с разворота достаточно, чтобы обеспечить энергоснабжение сотни планет Земля на протяжении 999 999 999 999 000 тысячелетий.
Чак Норрис может говорить о бойцовском клубе.
Когда первую серию «Крутого Уокера» показывали во Франции, французы сразу сдались Чаку — на всякий случай.
Когда Чак Норрис мочится, струей можно легко варить титан.
На самом деле Чак Норрис десяти футов роста, весит две тонны, дышит огнем, может съесть молоток и выдерживает выстрел из дробовика в упор.
Кратчайший путь к сердцу мужчины это кулак Чака Норриса.
Знак «парковка для инвалидов» не означает, что это именно место, где могут парковаться инвалиды. На самом деле он указывает, что парковочное место принадлежит Чаку Норрису и предупреждает, что произойдет с тем, кто вздумает там припарковаться.
Сюжет фильма про черепашек-ниндзя основан на реальных событиях. Просто однажды Чак Норрис проглотил черепаху и когда выкакал ее, она была шести футов роста и знала карате.
Когда Чак Норрис звонит по 1-900, он не платит. Он просто держит трубку, а деньги выпадают из телефона сами.
Если Чак Норрис занимается сексом с мужчиной это не значит, что он гей. Это просто значит, что временно кончились женщины.
Чак Норрис не пользуется полотенцем, вода сама убегает с Чака.
На самом деле Чак Норрис умер 10 лет назад. Просто Смерть[1] боится ему об этом сказать.
Чак Норрис изобрел винтовку, алкоголь, сексуальный контакт и футбол — именно в такой последовательности.
Чак Норрис никогда не читает книг. Он смотрит на них в упор, пока не получает всю необходимую ему информацию.
Однажды Чак Норрис съел торт прежде, чем его друзья успели сказать ему, что внутри сидит стриптизерша.
Чак Норрис — не здоров как бык, это бык — здоров как Чак Норрис.
Однажды кто-то сказал Чаку Норрису, что удар ногой с разворота — не лучший способ бить ногой. Историки утверждают, что это была самая страшная ошибка в истории человечества.
Военный юнит Чак Норрис не присутствует в игре «Цивилизация 4», потому что один юнит «Чак Норрис» уничтожит все нации вместе за один ход.
Чак Норрис не взбивает масло. Он бьет корову с ноги и масло вываливается из коровы.
Чак Норрис однажды сбил фашистский истребитель, прицелившись в него пальцем и крикнув «БА-БАХ!»
Когда Чак Норрис идет сдавать кровь, он не признает шприцов, но просит дать ему пистолет и ведро.
Один раз Чак Норрис противостоял Лэнсу Армстронгу в соревновании «У кого яиц больше?». Чак Норрис выиграл с преимуществом в 5.
Чак Норрис сформулировал новую теорию относительности, согласно которой существует множество вселенных, в которых Чак Норрис еще более крутой засранец, чем в нашей. Когда эта же теория была публично низложена Альбертом Эйнштейном, Чак Норрис влепил ему ногой с разворота, и теперь мы знаем Эйнштейна как Стивена Хокинга.
Чак Норрис ездит на грузовике из-под мороженого, украшенном человеческими черепами.
Чак Норрис является единственным человеческим существом, воплощающим принцип неопределенности Гейзенберга — никогда не знаешь точно, где и когда он наебнет тебе с ноги.
Чак Норрис поспорил с NASA, что сможет выжить в вакууме без скафандра. 19 июля 1999 года голый Чак Норрис вышел в открытый космос, пролетел над 14-ю штатами, разогревшись при этом до температуры 3000 градусов. Смущенное NASA публично объявило, что это был метеор и до сих пор должно Чаку Норрису пива.
На Нагасаки никогда не сбрасывали бомбы. Это Чак Норрис выпрыгнул из самолета и топнул.
Чак Норрис продал душу дьяволу в обмен на то, чтобы всегда прекрасно выглядеть и обладать несравненными способностями в боевых искусствах. Когда обмен был завершен, Норрис влепил дьяволу ногой с разворота и забрал свою душу обратно. Дьявол, всегда ценивший хорошие шутки, не рассердился и признал, что должен был предвидеть такой поворот событий. Теперь они вдвоем играют в покер каждую вторую среду месяца.
Однажды Чак Норрис так сильно вломил кому-то ногой с разворота, что его нога превысила скорость света, переместилась в прошлое и убила Амелию Эрхарт, когда та пролетала над Тихим океаном.
Чак Норрис — единственный человек, который обыграл стену в теннис.
Однажды Чак Норрис съел за час три двухкилограммовых бифштекса. Причем первые 45 минут он трахал официантку.
Великая Китайская стена была построена для защиты от Чака Норриса, но затея позорно провалилась.
Чак Норрис изобрел машину времени и отправился в прошлое, чтобы предотвратить убийство Джона Кеннеди. Когда Освальд выстрелил, Чак встретил все три пули своей бородой и отразил их. Голову Кеннеди разнесло исключительно от изумления.
У многих мужчин одно яйцо больше, чем другое. У Чака Норриса КАЖДОЕ яйцо больше другого.
Когда Чак Норрис падает в воду, он не становится мокрым — вода становится чакноррисовой.
У дома Чака Норриса нет дверей — только стены, сквозь которые он проходит.
Не существует никаких рас — есть просто люди, которых Норрис избил до разной степени синего и черного.
Чак Норрис пользуется ночником не потому, что боится темноты, а потому, что темнота боится Чака Норриса.
Когда Бог сказал: «да будет свет!», Чак ответил: «скажи „пожалуйста“».
Чак Норрис никогда не бреется — он просто бьёт себя с ноги в лицо. Единственная вещь, способная порезать Чака Норриса — это Чак Норрис.
Уилт Чемберлен утверждает что переспал более чем с 20.000 женщин за всю свою жизнь. А для Чака Норриса это всего лишь «скучный вторник».
Оружия массового поражения не существует. Есть только Чак Норрис.
Нет никакой теории эволюции — просто список существ, которых Чак Норрис пощадил.
Чак Норрис — это переодетый Император.
Чак Норрис прошел первый и второй Fallout в реальности.
Чак Норрис был четвертым волхвом, и даровал младенцу Иисусу бороду, которую тот носил до своей смерти. Трое других мудрецов, обидевшись, что Иисус предпочел подарок Чака, договорились и стерли отовсюду из библии имя Чака. Все трое вскоре погибли от загадочных ранений, связанных с ударом ногой с разворота.
Чак Норрис не заходит в Интернет. Он хранит все сайты в своей памяти, обновляя страницы морганием.
Чак Норрис перемалывает кофейные зерна своими зубами и кипятит воду на собственной ярости.
Чак Норрис может захлопнуть вращающуюся дверь.
Чак Норрис настолько быстр, что он может обежать землю кругом и ударить себя кулаком в голову сзади.
Нет такого понятия, как глобальное потепление. Чаку Норрису было холодно, и он увеличил температуру солнца.
Чак Норрис не пишет книг. Слова сами выстраиваются от страха перед ним.
Чак Норрис может делить на ноль.
Третий закон Ньютона неверен. Хотя он гласит, что сила действия равна силе противодействия, нет никакой силы, равной удару Чака Норриса ногой с разворота.
Чак Норрис изобрел черный цвет. Фактически, он изобрел весь видимый спектр цветов, кроме розового и голубого. Розовый цвет изобрел Том Круз. Голубой цвет изобрёл режиссёр фильма «Горбатая гора».
Люди изобрели автомобили, чтобы спастись от Чака Норриса. Чтобы не быть превзойденным в чем-то, Чак Норрис изобрел автомобильные аварии.
Godzilla — японская легенда о первом визите Чака Норриса в Токио.
Единственная вещь, которую не может пробить Чак Норрис ударом ногой с разворота, это жилетка Анатолия Вассермана.
Чак Норрис умеет говорить на ассемблере. Результатом попытки Вассермана научить Чака Норриса на нем петь стало предыдущее утверждение.
Чак Норрис так крут, что овцы считают его, когда он ложится спать.
Борода Чака Норриса настолько острая, что ей он шинкует бумагу, поэтому его никто никогда не бьет в голову.
Чак Норрис единственный, кто может укусить себя за лоб.
Презервативы не защищают Чака Норриса от СПИДа! Они защищают СПИД от Чака.
Изначально Чак Норрис должен был участвовать в компьютерной игре «Street Fighter», однако создатели игры были против, потому что герой Чака при нажатии на любую кнопку бил ногой с разворота и убивал противника.
Чак Норрис любую посуду делает одноразовой.
У Чака нет дня рождения, он существовал всегда, и именно он виноват в вымирании динозавров.
Чак Норрис не пользуется проверкой орфографии в Word`е. Если его написание не соответствует словарю, в Оксфорде редактируют словарь.
Чак Норрис всегда надевает презерватив наоборот. Так, чтобы ОН получал удовольствие.
Мама Чака Норриса пыталась сделать аборт. Восемь раз.
Однажды Чак Норрис подумал: А не продавать свою мочу как напиток? Теперь этот напиток известен как Red Bull.
Чак Норрис смотрел злу прямо в глаза. Он смотрел в зеркало.
Чак Норрис может просмотреть «60 минут» за 20 минут.
Чак уничтожил таблицу Менделеева, так как он признает только элемент неожиданности.
В календаре после 31-го марта идет 2-е апреля. Никто не обдурит Чака.
Дача Чака Норриса находится на Солнце.
Чак Норрис построил Эверест при помощи ведерка и лопатки.
Если вам приснится, что Чак Норрис ударил вас ногой с разворота, то вы умрете!
Чак Норрис может выпить галлон молока и его не вырвет.
Некоторые люди могут убить двух птиц одним камнем. Чак Норрис однажды убил четырёх птиц половиной камня. Вы говорите, что не может быть половины камня? Те четыре птицы тоже так думали…
Буква «P» означает «Chuck Norris». Как и все остальные буквы алфавита.
Рай Чака Норриса — война.
Чак Норрис ответственен за процесс фотосинтеза.
Чак Норрис не дышит. Он удерживает воздух в заложниках.
Чак Норрис может зажечь спичку о кусок мыла.
Чаку Норрису удалили гланды безопилой. Чак Норрис удалил себе гланды сам. Ударом ногой с разворота, естественно.
Чак Норрис может убить два камня одной птицей.
Если бы Чак Норрис женился на Ксении Собчак и взял ее фамилию, он был бы Чак Собчак.
Билл Гейтс живет в постоянном страхе, что компьютер Чака Норриса сломается.
Чак Норрис может слепить снеговика из дождя.
Чак Норрис может удалить Корзину.
Чак Норрис способен задушить вас радиотелефоном.
Чак Норрис может утопить рыбу.
Чак Норрис можнт за долю секунды уничтожить любого, но не Свирепого.
Когда Чак Норрис входит в комнату, он не включает свет — он выключает темноту.
Когда Чак Норрис смотрит в зеркало, оно разбивается. Даже стекло не настолько глупо, чтобы стоять между Чаком и Чаком.
Последняя цифра числа Пи — Чак Норрис.
Чак Норрис не знает, где вы живете. Он знает, где вы умрете.
Пули уклоняются от Чака Норриса.
Чак Норрис умеет ездить на заднем колесе одноколесного велосипеда.
Однажды кобра укусила Чака Норриса за ногу. После 5 дней мучительных страданий кобра умерла.
У Чака Норриса нет волос на яичках. Волосы не растут на стали.
Чак Норрис умеет поджигать муравьев с помощью лупы. Ночью.
В среднестатистической комнате присутствует 1242 предмета, которыми Чак Норрис может вас убить. Включая саму комнату.
Чак Норрис получил водительские права в возрасте 16 секунд.
Квадратный корень из Чака Норриса — боль. Не пытайтесь возвести Чака во вторую степень, результат — смерть.
Когда вы говорите: «Никто не идеален», Чак Норрис принимает это в качестве личного оскорбления.
Бронежилет — примитивная имитация биоинженерного синтетического материала, скопированного с кожи Чака Норриса.
Чак Норрис не снимался в фильме «300», потому что три удара ногой с разворота оканчивают фильм за 7 секунд.
Чак Норрис потерял девственность раньше своего отца.
Чаку Норрису не нужно прыгать. Он просто смотрит на землю и она отдаляется.
Аладдин потер лампу и выпустил Чака Норриса.
Чак Норрис заставляет плакать лук.
Чак Норрис не спит с пистолетом под подушкой, но с подушкой под пистолетом.
С момента рождения Чака Норриса в 1940-ом году смертность в результате удара ногой с разворота выросла на 13000 %.
Существует три стороны Силы: темная сторона, светлая сторона и Чак Норрис.
Удар ногой с разворота Чака Норриса настолько силен, что виден из космоса невооруженным глазом.
Если вам нужен список врагов Чака Норриса, посмотрите список вымерших видов.
Чак Норрис изобрел воду.
Чак Норрис — настоящий отец Люка Скайуокера.
Пенис Чака Норриса настолько большой, что имеет свой собственный пенис и он все равно больше вашего.
Бог хотел создать мир за 10 дней, но Чак Норрис дал всего 6.
Если у вас и у Чака Норриса одинаковое количество денег, то у Чака все равно больше.
Однажды Чак Норрис побил рекорд скорости на велосипеде без цепи и задней шины.
Когда медведь попытался съесть Чака Норриса, Чак показал медведю кулак и тот съел сам себя, потому что это был самый безболезненный способ умереть.
Чак Норрис часто жертвует кровь Красному Кресту. Свою собственную — никогда.
Ктулху — бывшее домашнее животное Чака Норриса, в незапамятные времена сбежавшее от него в глубины океана и, в результате, одичавшее. Теперь ктулху - домашнее животное Анатолия Вассермана
Оружие не убивает людей. Чак убивает людей.
Под бородой Чака Норриса нет подбородка, есть лишь еще один кулак.
У Чака два режима: ходить и убивать.
На 15-ый день потопа Ной открыл дверь ковчега, воды уже почти не было, но он снова запер дверь. Снаружи дрались Чак Норрис и Свирепый.
Основными причинами смерти в США являются: 1) Заболевание сердца; 2) Чак Норрис; 3) Рак.
Чак Норрис пользуется баллончиком слезоточивого газа, чтобы поперчить свой стейк.
Вопреки распространенному мнению, именно Чак Норрис, а не медуза на севере Австралии, является самым ядовитым существом на Земле. Через 3 минуты после укуса вы ощущаете следующие симптомы: лихорадка, галлюцинации, сыпь в виде бороды, уменьшение одежды в размерах и постоянное ощущение того, что вас пинают через лобовое стекло автомобиля.
Большинство людей имеют 23 пары хромосом. У Чака Норриса их 72… и все они ядовиты.
Если вы спросите у Чака Норриса: «Который час?». Он всегда отвечает: «2 секунды до». После того как вы спросите: «2 секунды до чего?», вы получите по лицу знаменитым ударом ноги с разворота.
Когда Чак Норрис оплачивает свои налоги, он посылает незаполненные формы и фотографию. Чаку Норрису не приходилось платить налоги, никогда.
Чак Норрис разработал секретный рецепт KFC, состоящий из 11 различных трав и специй. Но никто и никогда не упоминает 12-й: страх.
CNN была изначально создана как «Chuck Norris Network», для того чтобы драть задницы американцам в режиме реального времени.
Чак Норрис может победить вас в крестиках-ноликах за один ход.
Что последнее приходило в голову всем жертвам Чака Норриса? Его ботинок.
В полиции код 45-11 обозначает нападение на Чака Норриса или самоубийство.
Однажды кто-то заснял на видео, как Чак Норрис мочится. Теперь это видео называется «Крутой Уокер: Техасская резня бензопилой»
У Вассермана есть два незаконорожденных сына: Чак Норрис и Свирепый.
Начальная сцена в фильме «Спасение рядового Райна» основана на игре Чака Норриса в Вышибалы во втором классе.
Вопреки популярному мнению, в США нет демократии, в ней есть только Чактотура.
В библии Иисус превращал воду в вино. А Чак Норрис превращает это вино в пиво.
Чак Норрис может ударить вас с такой силой, что изменит структуру вашей ДНК.
Годы не щадят человека. Кроме того случая, когда этот человек — Чак Норрис.
Чак Норрис не принимает душ. Только кровавые ванны.
Вообще-то, Плутон — это орбитальная группа Британских солдат Американской революции, которые вышли в открытый космос после того, как получили от Чака по мордам ударом ноги с разворота.
Чак Норрис не может закончить раскладывать свои фломастеры по номерам, соответствуещим цвету, так как все его фломастеры наполнены кровью его жертв. К сожалению, вся кровь — темно-красная.
При помощи удара ноги с разворота Чака Норриса можно захватить власть в Австралии за 44 минуты.
Картина стоит тысячи слов. Картина с Чаком — миллардов слов.
Чак Норрис изобрел свой собственный стиль карате — Chuck-will-kill.
Когда говорит Чак все слушают. И умирают.
Когда Стивен Сигал убивает ниндзя, он использует свою скрытность. Когда Чак убивает ниндзю, он использует все.
При прохождении IQ теста на все вопросы отвечайте «Чак Норрис» и вы заработаете максимальное количество баллов.
Если вы Чак Норрис, то все + все равняется одному. Одному удару ноги с разворота.
В свой День Рождения Чак выбирает наугад одного счастливчика среди детей и забрасывает его на Солнце.
В начале было ничто, затем Чак Норрис пнул ударом ноги с разворота ничто в лицо и сказал: «За работу!» Так появилась наша вселенная.
У Чак Норриса 12 спутников. Один из них — Земля.
Археологи обнародовали древний словарь, датируемый 1236 годом, где определяется слово «жертва» как «тот кто столкнулся с Чаком Норрисом».
Однажды Чак Норрис заказал Биг Мак в Бургер Кинге. И получил его.
Мало кто знает, что кесарево сечение было изобретено Чаком, когда он произвел удар ногой с разворота в утробе матери.
Есть поговорка, что, если вам приснится ваша смерть, то вы умрете в реальной жизни. На самом деле, если вам приснится смерть, то Чак Норрис найдет вас и убьет.
Бермудский Треугольник был известен как Бермудский Квадрат до тех пор, пока Чак Норрис своим ударом ноги с разворота не выбил один угол.
В Ираке нет оружия массового поражения. Чак живет в Оклахоме.
Когда Чак приближается к толпе людей, он не обходит их. Он идет сквозь них.
Чак Норрис прошёл тетрис. Всеми концовками.
Однажды Чак Норрис выпил целую бутылку снотворного. После чего он стал моргать.
Сначала Джеймс Камерон хотел пригласить на роль терминатора Чака. Но после долгих раздумий он понял, что тогда фильм станет документальным. И он пригласил Шварценеггера.
Чак Норрис играл в Русскую рулетку с полностью заряженным пистолетом. И победил.
Чак Норрис настолько крут, что довел до оргазма резиновую женщину.
Яички Чака Норриса не производят сперму, они производят маленьких белых ниндзя, у которых одна миссия: найти и уничтожить.
Единственная вещь во Вселенной, которая нужна Чаку Норрису, это мозг Анатолия Вассермана.
Великая Китайская стена первоначально была создана, чтобы остановить Чака Норриса. Затея с треском провалилась.
Путь к сердцу мужчины лежит через кулак Чака Норриса.
Изначально идеей шоу «Последний герой» было отправлять людей на остров с Чаком Норрисом. Выживших не осталось. И никому не хватает смелости, чтобы вернуться на остров за отснятой пленкой.
На самом деле удар ногой с разворота не смертелен. Он лишь полностью стирает существование жертвы в пространственно-временном континууме.
Однажды Чак Норрис вырвал волос из своей бороды и проткнул им 3-х человек.
За каждым успешным мужчиной стоит женщина. За каждым трупом — Чак Норрис.
Единственный способ узнать возраст Чака Норриса — разрезать его пополам и сосчитать кольца.
В оригинале Библия была названа «Чак Норрис и друзья».
Согласно самой распространенной теории, Чак Норрис вернулся в прошлое и зачал сам себя.
Чак Норрис МОЖЕТ судить книгу по обложке.
На самом деле 11 сентября в небоскрёб не врезался самолёт, это Чак Норрис плюнул в форточку.
Чак Норрис использует гремучих змей вместо презервативов.
У Чака Норриса нет своего дома. Он просто входит в любой дом и хозяева переезжают.
Сколько Чаков Норрисов потребуется чтобы сменить лампочку? Нисколько, потому что Чак Норрис предпочитает убивать в темноте.
Приятнее давать, чем получать. Это особенно касается удара Чака Норриса ногой с разворота.
Чак Норрис не ест. Еда понимает, что единственное место, где можно укрыться от его кулаков — внутри его собственного тела.
Перед съемкой каждой серии Уокера Чаку Норрису вкалывают 14 смертельных доз слоновьего транквилизатора. Разумеется чтобы уменьшить его силу и подвижность, чтобы снизить смертность среди актеров, с которыми он дерется.
Чак Норрис однажды ударил лошадь по зубам. Ее потомков нынче называют жирафами.
Клонирование запретили, поскольку если клонировать Чака Норриса, то появится вероятность, что удар ногой с разворота одного Чака столкнется с ударом ногой с разворота другого. Физики утверждают, что это станет концом вселенной.
Чак Норрис победит в любой схватке, даже в схватке Бэтмана и Дарта Вэйдера.
У Чака Норриса нет часов, он сам решает сколько времени.
Первая работа Чака Норриса — разносчик газет. Никто не выжил.
Чак Норрис никогда не участвовал в драках. Разве можно назвать дракой один удар ногой с разворота в челюсть.
В мире всего два типа людей — засранцы и Чак Норрис.
Если ударить Чака Норриса по лицу сломаются все до единой кости в руке. Это только теория, ведь кто, находясь в здравом уме, попробует это сделать.
70 % массы человеческого тела составляет вода. 70 % веса Чака Норриса составляет его член.
Ван Дамм однажды побил Чака Норриса, потом он проснулся от удара ногой с разворота.
Говорят, что заглянув в глаза Чаку Норрису можно увидеть свое будущее. И это так, ведь будущее всех, кто посмел это сделать одно — смерть от удара ногой с разворота.
Чак Норрис не ходит к стоматологу, потому что его зубы невыбиваемы. Враги Чака Норриса не ходят к стоматологу, потому что у них нет зубов.
Когда Чак Норрис играет в «Монополию» его действия вызывает изменения в мировой экономике.
Многие боятся смерти. Чак Норрис считает ее многообещающим новичком.
Чака Норриса исключили из соревнований по родео, после того как он проехал на быке 1346 миль чтобы забрать вещи из химчистки.
Чак Норрис выиграл чемпионат Формулы-1… без машины.
Один человек подал в суд на Чака Норриса за то, что он дважды побил его. Суд отклонил иск, поскольку никто не пережил бы даже первого раза.
Инопланетяне существуют! Они просто боятся соваться на планету, на которой живет Чак Норрис
Каждый раз когда Чак Норрис улыбается кто-то умирает. Если только он не улыбается во время удара ногой с разворота. В этом случае умирает два человека.
Чак Норрис не видит мертвых. Он их делает.
Чак Норрис бьет ногой с разворота быстрее скорости света. Это значит, что если ты включишь лампочку ты умрешь раньше чем увидишь свет.
Чак Норрис никогда не получал Оскара за актерскую игру потому что он не играет!
Не все, на кого зол Чак Норрис умирают. Некоторым удается уйти. Их называют космонавтами.
Чак Норрис не следит за модой, это мода следит за Чаком Норрисом. Когда Чак это обнаружил он вмазал моде ногой с разворота. Никто не смеет следить за Чаком Норрисом.
Чак Норрис изобрел тротилл чтобы лечить запоры.
Чак Норрис однажды убил продавца гербалайфа ударом ногой с разворота. По телефону.
Посчитай от одного до десяти. Вот сколько времени потребуется Чаку чтобы убить тебя… сорок семь раз.
Чак Норрис вынужден был перестать стирать одежду в океане. Цунами убили слишком много людей.
В первом «Парке Юрского периода» Тиранозавр не гнался за джипом — он убегал от Чака Норриса.
В древнем китае была легенда: однажды из чрева дракона родится ребенок, он вырастет человеком и изгонит зло с земли. Этот человек не Чак Норрис, потому что Чак Норрис убил этого человека.
Самые суровые люди едят на завтрак гвозди. Чак Норрис покупает всю еду в магазине стройматериалов.
Пульс Чака Норриса измеряется по шкале Рихтера
Многие знают, что Декарт сказал «Я мыслю и поэтому живу…». Но не все знают что фраза продолжается «…в страхе перед Чаком Норрисом»
Во время войны во Вьетнаме Чак Норрис однажды нарочно сдался в плен. Его пытали, заставляя есть собственные внутренности. Он попросил добавки.
Чак Норрис может набирать 21 одной картой.
Чак Норрис использует дублеров для съемки сцен, в которых его герой плачет.
Молния никогда не ударяет дважды в одно место, потому что ее ищет Чак Норрис.
Молния не может ударить Чака Норриса, но Чак Норрис может ударить молнию.
Когда Чак Норрис выплевывает арбузные семечки у пулемета развивается комплекс неполноценности.
Чак Норрис может выстрелить в тебя и все равно успеть дать тебе ногой с разворота раньше, чем долетит пуля.
Бумеранг не возвращается к Чаку Норрису. Он боится возвращаться.
Чак Норрис порхает как бабочка, жалит как ракета томогавк. На скорости 3 маха. В челюсть.
Чак Норрис может хлопать одной ладонью.
Горизонт молчания описывается радиусом удара ноги с разворота Чака Норриса.
Долго смотреть можно только на три вещи:огонь, воду и удар Чака Норриса ногой с разворота.
Однажды Чака Норриса спросили: как с помощью веревки неравномерно горящей 30 минут и зажигалки отмерить 15 минут? Чак Норрис ответил: «не знаю». И был прав.
Чака Норриса настолько боятся его враги, что при встрече с ним убивают себя ударом ноги с разворота.
Баррак Обама - чернокожий помощник Чака Норриса.
Только Чак Норрис может послать хрен нахрен.
Однажды Якудза попытались уничтожить Чака Норриса за разрушение Хиросимы и Нагасаки, вследствии этого факта у японской мафии появился девиз "Ошибки не справляют, их смывают кровью", а также менее известные вариации "Ошибки исправляют ногой" и "Все что не ЧК(Чак Норрис) - ошибка"
Если добавить 1 грамм какашки Чака Норриса в стакан воды, и налить эту воду в тихий океан, то у всех рыб переломаются позвоночники.
Чак Норрис живет на 10-ом этаже, но когда он после стирки вешает трусы, чтоб высушить, они закрывают свет в квартирах 1-ого этажа.
Когда Чак Норрис играет в кости, никто не осмеливается к нему подходить, иначе он возьмет новые кости.
Чак ненавидит своего брата Свирепого, он уже 14 раз его убивал.
"""


def get_random_chuck() -> str:
    """Returns a random string from the pool

    Returns:
      Random curse as text"""

    texts = TEXT_POOL.split('\n')
    texts_cleaned = []
    for curse in texts:
        if curse:
            texts_cleaned.append(curse)

    return random.choice(texts_cleaned)


if __name__ == '__main__':
    print(get_random_chuck())
