import random

TEXT_POOL = """
Твоя мамка на столько жирная, что если у нее на спине нарисовать букву H то можно посадить вертолет
Я слышал твоя мама села на айфон и он стал айпадом
Твоя мама такая толстая, что в ресторанах написано: «Вместительность 300 человек, или твоя мама»
Твоя мамаша такая жирная, что для выпускного альбома её фотографировали с вертолёта.
Твоя мама такая толстая, что использует матрасы вместо тампонов!
Твоя мама такая толстая, что она плавала в окене и все принимали ее за новый континет!
Твоя мамка такая жирная, что у неё есть собственный почтовый индекс.
От жира твоей матери пахнет так сильно, что даже люди рядом с ней пердят, чтобы пахло нормально.
Твоя мамаша настолько жирная, что она не сидит в однокласниках, потому-что одним пальцем нажимает всю клавиатуру
Твоя мамаша настолько жирная, что на её завтрак ошибочно собираются фанаты Октоберфест.
Если долго смотреть на небо, то можно увидеть созвездие твоей жирной мамаши!
Твоя мамаша настолько жирная, что не помещается в панорамный режим
Твоя мама такая жирная, что даже тот чувак, которому удалили глаза из-за болезни, смог разглядеть ее силуэт.
Твоя мамаша такая жирная, что зона 51 это как раз то место, где пришельцы потерпели крушение, пытаясь похитить ее.
Твоя мама такая жирная, что в макдональдсе ее обслуживают сразу на трех кассах.
Твоя мамаша такая жирная, что ее ходьба заставляет землю крутиться.
Твоя мама такая жирная, что Samsung именно из-за нее сделали эти огромные телефоны.
Твоя мама такая жирная что после того как она заходит в комнату нужно делать ремонт.
Твоя мама настолько жирная, что когда она нагибается все думают что это вход в метро!
Твоя мама такая толстая, что люди орут: "Такси!", когда она надевает желтую ветровку!!
Ученые вывели людей из заблуждения, оказывается титаник врезался в твою мамашу
Твоя мать настолько жирная, что думает, что шведский стол это всего лишь закуска.
Твоя мамаша настолько жирная, что ест курицу гриль как наггетсы!
Твоя мамаша настолько жирная, что когда она пришла сниматься в кино, ей дали роль дома.
Твоя мама настолько жирная, что когда она заходит в лифт, он едет только вниз.
Твоя мама такая жирная что её чуть было не перепутали в "эльдорадо" с холодильником и не купили
Когда я гуглил фотки твоей мамаши, в "инструментах поиска" был только один вариант размера — "большой".
Я не открываю гифы про твою мамашу, потому что они слишком много весят!!
Твоя мама такая ЖИРНАЯ, что древние греки думали, якобы это Земля вращается вокруг твоей мамы!
Твоя мамаша такая ЖИРНАЯ, что когда у неё пищит пейджер, то все думают, что она сдаёт назад!!
Твоя мама такая жирная, что падает сразу с двух сторон кровати
Твоя мама настолько толстая, что пока она проходила мимо телевизора я пропустил 3 серии
Твоя мамаша ТАКАЯ ЖИРНАЯ, что все хотели переименовать "Big Ben" в ПРОСТО "Ben" !
Твоя мамаша такая жирная, что компания производившая для нее одежду, обанкротилась, делая трусы
Полеты на луну прекратились, когда узнали, что это твоя жирная мамаша.
Твоя мама настолько жирная, что ее гравитация заставляет ракетчиков добавлять еще топлива, при полетах на луну
В США восстановили популяцию бизонов, но до этого они вымерли из-за твоей мама
Твоя мама настолько жирная, что когда приходит к зубному, он берет алпинисткое снаряжение, чтобы осмотреть ее зубы
Твою маму предложили классифицировать как газовый гигант
Раковые клетки, в теле твоей матери, умерают от холестерина
В космосе, при фазовом переходе, учитывается масса твоей мамки
Уменьшающие диски чаловека-муравья не подействуют на твою маму
Твоя мама не влезла в черную дыру TON 618
Что бы следить за твоей мамой с орбиты, не нужны спутники
Пароль "твоя мамка" будет слишком большой
Квантовый супер кампутир взорвался при подсчете массы твоей мамки
Когда в твою маму выстрелили из уменьшающего луча, то ничего не изменилось, но прибор увеличился
Когда твоя мамка упала, то на противоположной стороне планеты образовался горный хребет
Когда твоя мамка упала, то вымерли динозавры
Ною сильно повезло, ведь у него уже был корабль, когда твоя мама зашла в море
Даже в космосе твоя мамка летит вниз
Твою маму можно использовать вместо асфальтоукладчика. Хотя нет - свежий алфальт не выдержит
И к другим новостям: в городе замечена твоя мамка, план эвакуации гражданских привели в действие
В подмышке твоей мамки построили лесоперерабатывающий завод
При твоём рождении на твою маму снарядили экспедицию
Твоя мама искревляет пространство сильнее чем чёрная дыра
Что бы припарировать твою маму нужна бензопила
В пейнте твою маму получится нарисовать только самыми жирными линиями
Если взять твою маму за единицу измерения массы, то вселенная будет весить 0.02 мамкограмм
Твоя мамаша такая толстая, что когда она пошла в KFC и её спросили, какого размера ведро ей нужно, она ответила: "То, что на крыше"
"""


def get_random_mama() -> str:
    """Returns a random string from the pool

    Returns:
      Random curse as text"""

    texts = TEXT_POOL.split('\n')
    texts_cleaned = []
    for curse in texts:
        if curse:
            texts_cleaned.append(curse)

    return random.choice(texts_cleaned)


if __name__ == '__main__':
    print(get_random_mama())
